linux/order/shell-node.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-13 三 00:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>shell-node</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
</head>
<body>
<div id="content">
<h1 class="title">shell-node</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbcf0d37">1. shell</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbcf0d37" class="outline-2">
<h2 id="orgbcf0d37"><span class="section-number-2">1</span> shell</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>+1</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=0
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>
((a++))
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
| 0 |
| 1 |
</pre>
</div>


<ul class="org-ul">
<li>let</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-68;">let</span> a++
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>
<span style="color: color-68;">let</span> <span style="color: color-79;">a</span>=1+1 <span style="color: color-79;">b</span>=1+2
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span> $<span style="color: color-79;">b</span>
<span style="color: color-68;">let</span> <span style="color: color-113;">"t1=((a=1+3,b=1+4,c=1+2))"</span>
<span style="color: color-68;">echo</span> <span style="color: color-113;">"t1 = $t1"</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">let&#21518;&#36319;&#34920;&#36798;&#24335;, a&#40664;&#35748;&#26159;0</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">&#21487;&#20197;&#19968;&#27425;&#23450;&#20041;&#22810;&#20010;</span>
|  1 |   |   |
|  2 | 3 |   |
| t1 | = | 3 |
</pre>
</div>
<ul class="org-ul">
<li>expr</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=1
<span style="color: color-79;">a</span>=$(expr $<span style="color: color-79;">a</span> + 1)
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>
<span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">EXPR $a + 1 &#20013;&#38388;&#35201;&#26377;&#31354;&#26684;</span>
<span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">*&#35201;&#36716;&#20041; \*</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
: 2
</pre>
</div>

<ul class="org-ul">
<li>进制转换</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">!/bin/</span><span style="color: color-167;">bash</span>
<span style="color: color-68;">echo</span> <span style="color: color-113;">'obase=2; ibase=10;   10'</span> | bc -l
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">&#36755;&#20986; &#36755;&#20986;&#26684;&#24335;    &#36755;&#20837;&#26684;&#24335;  &#36716;&#25442;&#25968;&#23383;  &#20351;&#29992;&#26041;&#24335;</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
: 1010
</pre>
</div>

<ul class="org-ul">
<li>浮点数运算</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">let a=1.2+1.2  &#38169;&#35823; &#19981;&#34892;</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">a=10.1</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">b=10.2</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">echo $((a+b)) # &#19981;&#25903;&#25345;</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">bc</span>
<span style="color: color-79;">a</span>=10.1
<span style="color: color-79;">b</span>=10.2
<span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>+$<span style="color: color-79;">b</span>|bc
<span style="color: color-68;">echo</span> <span style="color: color-113;">'scale=3;1/4'</span>+1 |bc
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">scale &#31934;&#24230;</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
| 20.3 |
| 1.25 |
</pre>
</div>

<ul class="org-ul">
<li>三元运算符</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=100
((<span style="color: color-79;">b</span> = a &gt; 100 ? 200 : 50))
<span style="color: color-68;">echo</span> $<span style="color: color-79;">b</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
: 50
</pre>
</div>

<ul class="org-ul">
<li>if</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=20
<span style="color: color-167;">if</span> (($<span style="color: color-79;">a</span> &gt; 10));<span style="color: color-167;">then</span>
  <span style="color: color-68;">echo</span> <span style="color: color-113;">"..."</span>
<span style="color: color-167;">fi</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
: ...
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">name</span>=<span style="color: color-113;">"rzry"</span>

<span style="color: color-167;">if</span> [[ <span style="color: color-113;">"$1"</span>==<span style="color: color-113;">""</span> ]];<span style="color: color-167;">then</span>
   <span style="color: color-79;">name</span>=<span style="color: color-113;">"$1"</span>
<span style="color: color-167;">elif</span> [[<span style="color: color-113;">"$1"</span>==<span style="color: color-113;">"rzry"</span>]];<span style="color: color-167;">then</span>
   <span style="color: color-79;">name</span>=<span style="color: color-113;">"rzry_test"</span>
<span style="color: color-167;">else</span>
   <span style="color: color-79;">name</span>=<span style="color: color-113;">"else"</span>
<span style="color: color-167;">fi</span>
<span style="color: color-68;">echo</span> $<span style="color: color-79;">name</span>

</pre>
</div>
<ul class="org-ul">
<li>until</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=8
<span style="color: color-167;">until</span> ((a&gt;=10));<span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> $((a++))
<span style="color: color-167;">done</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">&#26465;&#20214;&#20026;&#30495;&#26102;break</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
| 8 |
| 9 |
</pre>
</div>

<ul class="org-ul">
<li>for</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">
<span style="color: color-167;">for</span> ((<span style="color: color-79;">i</span>=0;i&lt;2;i++));<span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> <span style="color: color-113;">"index : $i"</span>
<span style="color: color-167;">done</span>

<span style="color: color-167;">for</span> i<span style="color: color-167;"> in</span> {1..10..3};<span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> <span style="color: color-113;">"Test2 : $i"</span>
<span style="color: color-167;">done</span>

<span style="color: color-167;">for</span> i<span style="color: color-167;"> in</span> <span style="color: color-68; font-weight: bold;">`seq 1 2 5`</span>; <span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> <span style="color: color-113;">"Test3 : $i"</span>
<span style="color: color-167;">done</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">+RESULTS:</span>
| index | : |  0 |
| index | : |  1 |
| Test2 | : |  1 |
| Test2 | : |  4 |
| Test2 | : |  7 |
| Test2 | : | 10 |
| Test3 | : |  1 |
| Test3 | : |  3 |
| Test3 | : |  5 |
</pre>
</div>

<ul class="org-ul">
<li>while</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=0
<span style="color: color-167;">while</span> [ $<span style="color: color-79;">a</span> -lt 2 ]; <span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> $<span style="color: color-79;">a</span>
    ((a++))
<span style="color: color-167;">done</span>
<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">lt &#23567;&#20110;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-79;">a</span>=11
<span style="color: color-167;">while</span> [ $<span style="color: color-79;">a</span> -gt 10 ]; <span style="color: color-167;">do</span>
    <span style="color: color-68;">echo</span> $((a--))
<span style="color: color-167;">done</span>
</pre>
</div>
<pre class="example">
-eq           //等于
-ne           //不等于
-gt            //大于
-lt            //小于
-ge            //大于等于
-le            //小于等于
</pre>

<div class="org-src-container">
<pre class="src src-shell">cat ./1.txt | <span style="color: color-167;">while </span><span style="color: color-68;">read</span> res hello; <span style="color: color-167;">do</span> <span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">&#21033;&#29992; read &#20250;&#35835;&#21462; '\n' &#29305;&#24615;&#65292;&#26469;&#19968;&#27425;&#35835;&#21462;&#19968;&#34892;</span>
  <span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">echo $line &#25171;&#21360;&#27599;&#19968;&#34892;</span>
   printf <span style="color: color-113;">"%1s\n"</span> $<span style="color: color-79;">res</span> $<span style="color: color-79;">hello</span>
<span style="color: color-167;">done</span>

<span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">read &#20174;&#26631;&#20934;&#36755;&#20986;&#24471;&#21040;&#32467;&#26524;,&#36171;&#20540;&#32473; &#22810;&#20010;&#21464;&#37327;</span>
<span style="color: color-79;">name</span>=htop.txt
<span style="color: color-68;">echo</span> q| htop | aha --black --line-fix &gt; $<span style="color: color-79;">name</span>
cat $<span style="color: color-79;">name</span> | <span style="color: color-167;">while </span><span style="color: color-68;">read</span> pid user ; <span style="color: color-167;">do</span>
    printf <span style="color: color-113;">"%s %s \n"</span> $<span style="color: color-79;">pid</span> $<span style="color: color-79;">user</span>
<span style="color: color-167;">done</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-167;">while </span><span style="color: color-68;">read</span>  des what mask iface; <span style="color: color-167;">do</span>
    <span style="color: color-243; font-style: italic;">#</span><span style="color: color-243; font-style: italic;">echo $des $what $mask $iface</span>
    printf <span style="color: color-113;">"%s %s\n"</span> $<span style="color: color-79;">des</span> $<span style="color: color-79;">mask</span>
<span style="color: color-167;">done</span> &lt; &lt;(route -n)
</pre>
</div>

<ul class="org-ul">
<li>switch</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: color-167;">case</span> $<span style="color: color-79;">1</span><span style="color: color-167;"> in</span>
  a)       <span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">&#25509;&#21463; a</span>
      <span style="color: color-68;">echo</span> <span style="color: color-113;">"a"</span>
      ;;
  b|c)     <span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">&#25509;&#21463; b &#25110; c</span>
      <span style="color: color-68;">echo</span> <span style="color: color-113;">"b or c"</span>
      ;;
  ?)       <span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">&#25509;&#21463;&#20219;&#24847;&#19968;&#20010;&#23383;&#31526;</span>
      <span style="color: color-68;">echo</span> <span style="color: color-113;">"chat default case"</span>
      ;;
  *)       <span style="color: color-243; font-style: italic;"># </span><span style="color: color-243; font-style: italic;">&#25509;&#21463;&#20219;&#24847;&#30340;&#23383;&#31526;&#25110;&#23383;&#31526;&#20018;</span>
      <span style="color: color-68;">echo</span> <span style="color: color-113;">"default case"</span>
      ;;
<span style="color: color-167;">esac</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-01-12</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2021-01-13 三 00:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
